{
  "meta": {
    "theme": "orbit"
  },
  "basics": {
    "name": "Daniel Kühne",
    "label": "Platform and Cloud engineer",
    "image": "https://dakue.github.io/resume/dakue.jpg",
    "email": "dkhmailto@gmail.com",
    "website": "https://dakue.github.io/resume",
    "phone": "+49 174 3295332",
    "summary": "My biggest passion is to build infrastructure, pipelines and processes which help others to unleash their full potential. To accomplish this, I build environments in IaC on public clouds and on premise. Since 'you never walk alone', I surround myself with great people to achieve great things together.",
    "location": {
      "city": "Berlin",
      "countryCode": "DE"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "dakue",
        "url": "https://github.com/dakue"
      },
      {
        "network": "Xing",
        "username": "Daniel_Kuehne24",
        "url": "https://xing.com/profile/Daniel_Kuehne24"
      },
      {
        "network": "LinkedIn",
        "url": "https://linkedin.com/in/daniel-kuehne-berlin"
      }
    ]
  },
  "work": [
    {
      "company": "Stealth",
      "position": "DevOps Engineer",
      "website": "stealth",
      "startDate": "2022-01-01",
      "endDate": "2022-05-31",
      "summary": "I'm not working directly for this company but for one of the Spin-Offs which is an IOT platform. There I'm part of the core team responsible for the development and operation of the platform on different clouds and for different customers.",
      "highlights": [
        "refactoring of the release pipeline to use GitOps with ArgoCD and the app of apps pattern",
	"creating of a developer cloud using a root server and Opennebula including IaC, dynamic Envoy ingress configuration and pull request workflow to include changes",
	"improving the developer expierence by creating self service environments for the development of the IOT platform and establishing an internal developer platform",
	"introducing an ADR process using MADR templates",
	"evaluating a data aggregation service using Thanos as datastore",
	"used technologies - Google Cloud (GCP, IAM, Compute Engine Networks), Azure (AKS, Networks), Opennebula, Talos Linux, Kubernetes, Docker, Helm, ArgoCD, GitOps, Envoy, Crossplane, TimescaleDB, CockroachDB, Kafka, EMQX, Redis, TiKV, Jaeger, Prometheus, Sentry, Jira, Notion, Slack, Figma, Miro"
      ]
    },
    {
      "company": "sennder GmbH",
      "position": "Staff Platform Engineer",
      "website": "https://www.sennder.com/",
      "endDate": "2021-12-31",
      "startDate": "2021-05-01",
      "summary": "I joined sennder in its hypergrowth phase and together with the rest of the platform team (4 people) my mission was to advocate my knowledge throughout engineering (approx. 200 people) by:",
      "highlights": [
        "creating a migration strategy and technical research and development to move the VPCs to a new CIDR range inlcuding options for zero downtime",
        "introducing of a CI template library for platform related GitLab jobs",
        "regular hosting of the DevOps community of practice including the creation of a quiz and the organization of the event",
        "founding and participating in a working group to create an onboarding workshop including the first deployment of a frontend and a backend with the focus on developer experience, CI/CD and the platform",
        "participating in an initiative to create a platform product including user interviews and priotization",
        "participating in a working group to build the next generation authentication and authorization including the move to a new user directory with the focus on interoperability and developer experience",
        "participating in a working group to build the next generation microservices and move away from a monolith with the focus on developer experience",
        "participating in the architecture board to create a catalogue of validated blueprints",
        "used technologies - AWS (IAM, EKS, ECS, S3, NLB, ALB, RDS, DocumentDB, CloudFront, SNS, SQS, API Gateway, KMS, Lambda, Database Migration Services, Control Tower, SSO), Gsuite, Auth0, Kubernetes, Docker, Helm, Terraform, Redis, PostgreSQL, Python, GitLab, SonarQube, Datadog, Opsgenie, Confluence, Jira, Asana, Productboard, Jellyfish"
      ]
    },
    {
      "company": "Architrave GmbH",
      "position": "Engineering manager / Expert SRE",
      "website": "https://www.architrave.de/",
      "startDate": "2020-09-01",
      "endDate": "2021-04-30",
      "summary": "",
      "highlights": [
        "leading development and operations processes inside the team",
        "built and managed a team of 3 experts",
        "developed the technical skill of new joiners in- and outside of my teams",
        "introduce a sustainable DevOps culture, e.g. through the setup of an open platform model to allow developers to contribute infrastructure changes via merge requests and the creation of sample applications as best practice examples",
        "design, setup and operate multiple AWS environments based on EKS and used daily by 20+ users",
        "introduce a secrets management based on Mozilla Sops and AWS KMS",
        "consult the decision for a multi tenancy approach including proof of concepts",
        "automate the setup of AWS accounts in an AWS organizations with SSO IDP and Gsuite groups",
        "used technologies - AWS (IAM, EKS, S3, NLB, ALB, RDS, CloudFront, SNS, SQS, API Gateway, Glue, KMS), Gsuite, Kubernetes, Docker, Helm, Terraform, Terragrunt, Ansible, RabbitMQ, Redis, PostgreSQL, Python, GitLab, Prometheus, Alertmanager, Grafana, ELK, Nginx, Confluence, Jira"
      ]
    },
    {
      "company": "DKB Code Factory GmbH",
      "position": "Lead Platform Engineer",
      "website": "https://www.dkbcodefactory.com/",
      "startDate": "2019-11-01",
      "endDate": "2020-08-31",
      "summary": "As the first DevOps in the whole DKB group I created and maintained a new development environment for up to 15 development teams. Since this task is to big for just one person, I also built and managed a platform team.",
      "highlights": [
        "leading development and operations processes inside the team",
        "built and managed a team of 8 members",
        "developed the technical skill of new joiners in- and outside of my teams",
        "introduce a sustainable DevOps culture, e.g. through setup of a contributor model to allow developers to contribute infrastructure changes via merge requests",
        "founding of a Cloud Working Group ( create and validate governance rules, create technologie templates for AWS services, check for compliance with IT security, setup of AWS organization and accounts)",
        "design, setup and operate multiple hardened AWS development environments based on Kubernetes and used daily by 100+ users",
        "migrate all users and services to the development environments",
        "SSO for Kubernetes and all platform applications based on Azure AD, eg. GitLab, Grafana, Kibana, …",
        "setup and operate GitLab as repository and CI/CD service for 100+ users",
        "automate the setup of AWS accounts with SSO IDP and Azure AD groups",
        "participate in the implementation of the corporate governance and an ISMS during the setup of the company internal IT",
        "operate the company internal IT",
        "used technologies - AWS (IAM, EC2, S3, Transit Gateway, NLB, ALB, RDS, CloudFront, Workspaces), Azure AD, Kubernetes, Docker, Helm, Terraform, Ansible, RabbitMQ, Redis, PostgreSQL, Python, GitLab, dex, Prometheus (Operator), Alertmanager, Grafana, ELK, Nginx, Confluence, Jira, Bitbucket, Jenkins"
      ]
    },
    {
      "company": "A.T.U Auto-Teile-Unger Handels GmbH & Co. KG",
      "website": "https://www.atu.de",
      "position": "Lead DevOps Engineer",
      "startDate": "2016-06-01",
      "endDate": "2018-10-31",
      "summary": "My mission was to create a completly new environment for the next generation of services and to support the DevOps culture at A.T.U.   ",
      "highlights": [
        "leading development and operations processes inside the team",
        "built and managed a team of 5 members",
        "design, create and operate an AWS environment with Ansible for microservices based on Java and PHP",
        "design and create a microservice platform based on Kubernetes for production, q&a and development stages",
        "create CI/CD pipelines based on makefile build packs, Ansible, Helm using Concourse CI to deploy to all environments",
        "create build pack scripts based on make",
        "setup monitoring and alerting based on Prometheus",
        "deploy and maintain an ELK stack",
        "create a Ansible module template to deploy Docker containers using docker-compose as a host service",
        "used technologies - AWS (IAM, EC2) , Ansible, Terraform, Helm, Kubernetes, Docker, Prometheus, Alertmanager, Grafana, ELK, Apache Kafka, Consul, Redis, Nginx, Concourse CI, Python, Confluence, Jira, Bamboo"
      ]
    },
    {
      "company": "The unbelievable Machine Company GmbH",
      "website": "https://www.unbelievable-machine.com",
      "position": "System Architect Web Operations",
      "startDate": "2014-09-01",
      "endDate": "2016-05-31",
      "summary": "",
      "highlights": [
        "design and implement extensions for new and existing customer environments",
        "consulting for customers in architectur and technologies",
        "evaluate new technologies and their usage in existing customer environments",
        "tech lead for a customer with responsibility for up to 5 engineers",
        "automate the installation of software and servers",
        "design and implementation of automation for processes",
        "used technologies - Puppet, Ansible, Nagios, Juniper SRX, Apache Hadoop (Hortonworks, Cloudera), Apache Spark, Elasticsearch, Splunk, Apache Kafka, Mozilla Heka, Zendesk, Jira, Confluence ..."
      ]
    },
    {
      "company": "notebooksbilliger.de AG",
      "website": "https://www.notebooksbilliger.de",
      "position": "Senior IT-Systemadministrator",
      "startDate": "2013-11-01",
      "endDate": "2014-08-31",
      "summary": "",
      "highlights": [
        "troubleshooting, maintenance and enhancement of the production and development environments for the online shop and the enterprise server bus (Java based)",
        "automation of all possible processes",
        "wrote a Munin plugin for Jolokia",
        "introduction of new technologies (Solr, Logstash, Puppet, Docker)",
        "used technologies - Puppet, Solr, Logstash, Docker, CDN, MySQL, PHP-FPM, Jolokia, Nagios, Munin"
      ]
    }
  ],
  "education": [
    {
      "institution": "Technische Universität Berlin",
      "area": "Electrical Engineering",
      "studyType": "Bachelor of Science",
      "startDate": "2010-10-01",
      "endDate": "2012-10-01"
    }
  ],
  "skills": [
    {
      "name": "Lead responsibilities",
      "level": "Master",
      "keywords": []
    },
    {
      "name": "Motivated",
      "level": "Master",
      "keywords": []
    },
    {
      "name": "Passioned",
      "level": "Master",
      "keywords": []
    },
    {
      "name": "Kubernetes",
      "level": "master",
      "keywords": [
        "nginx-ingress",
        "kubespray",
        "Calico",
        "kubeadm"
      ]
    },
    {
      "name": "Helm",
      "level": "Master",
      "keywords": []
    },
    {
      "name": "AWS",
      "level": "advanced",
      "keywords": [
        "IAM",
        "EC2",
        "VPC",
        "Transit Gateway",
        "S3",
        "CloudFront"
      ]
    },
    {
      "name": "Terraform",
      "level": "Master",
      "keywords": [
        "Terraform modules"
      ]
    },
    {
      "name": "Ansible",
      "level": "Advanced",
      "keywords": [
        "Ansible roles"
      ]
    },
    {
      "name": "CI/CD",
      "level": "Master",
      "keywords": [
        "GitLab CI",
        "Concourse CI",
        "Jenkins",
        "Bamboo"
      ]
    },
    {
      "name": "Python",
      "level": "Advanced",
      "keywords": []
    },
    {
      "name": "Shell",
      "level": "Master",
      "keywords": []
    }
  ],
  "languages": [
    {
      "language": "German",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "fluently"
    }
  ],
  "publications": [],
  "interests": [
    {
      "name": "Gardening"
    },
    {
      "name": "Open Source"
    },
    {
      "name": "Conferences / Meetups"
    },
    {
      "name": "Cycling"
    }
  ],
  "references": [],
  "volunteer": [],
  "awards": []
}
